#ifndef BSP_USART_H
#define BSP_USART_H



/***************************************************************************************************
* 函数名称:void bsp_usart1_Init(uint32 bounds)
* 入口参数:bounds:串口波特率
* 返 回 值:None
* 功能描述:	  					
*	  Note:		
* 修改记录:	  
***************************************************************************************************/
void bsp_usart1_init(uint32 bounds);

/***************************************************************************************************
* 函数名称:void bsp_usart1_SendDt(uint8_t* ucpbuff, uint8_t uclen)
* 入口参数:ucpbuff:待发送的数据
			uclen:发送的数据长度
* 返 回 值:None
* 功能描述:	  					
*	  Note:		
* 修改记录:	  
***************************************************************************************************/
void bsp_usart1_SendDt(uint8_t* ucpbuff, uint8_t uclen);





#endif
